Masmiseim36/nxpSDK/boards/evkmimxrt1180/demo_apps/mc_pmsm/pmsm_enc/cm7/pin_mux.c
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8B
mcu_data: ksdk2_0
processor_version: 0.15.10
pin_labels:
- {pin_num: N12, pin_signal: GPIO_AD_00, label: PWM_AT, identifier: PWM_AT}
- {pin_num: R14, pin_signal: GPIO_AD_01, label: PWM_AB, identifier: PWM_AB}
- {pin_num: R13, pin_signal: GPIO_AD_02, label: PWM_BT, identifier: PWM_BT}
- {pin_num: R15, pin_signal: GPIO_AD_03, label: PWM_BB, identifier: PWM_BB}
- {pin_num: P13, pin_signal: GPIO_AD_05, label: PWM_CT, identifier: PWM_CT}
- {pin_num: P15, pin_signal: GPIO_AD_04, label: PWM_CB, identifier: PWM_CB}
- {pin_num: N13, pin_signal: GPIO_AD_06, label: CUR_A, identifier: CUR_A;CUR_A1}
- {pin_num: K15, pin_signal: GPIO_AD_21, label: CUR_A, identifier: CUR_A;CUR_A2}
- {pin_num: T17, pin_signal: GPIO_AD_07, label: CUR_B, identifier: CUR_B}
- {pin_num: K12, pin_signal: GPIO_AD_22, label: CUR_C, identifier: CUR_C}
- {pin_num: R16, pin_signal: GPIO_AD_09, label: VOLT_DCB, identifier: VOLT_DCB}
- {pin_num: T14, pin_signal: GPIO_AD_08, label: TP0, identifier: TP0}
- {pin_num: N15, pin_signal: GPIO_AD_13, label: TP1, identifier: TP1}
- {pin_num: P17, pin_signal: GPIO_AD_12, label: TP2, identifier: TP2}
- {pin_num: B4, pin_signal: GPIO_AON_04, label: SW8, identifier: SW8}
- {pin_num: M16, pin_signal: GPIO_AD_27, label: USER_LED1, identifier: USER_LED1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbar.h"
#include "fsl_iomuxc.h"
#include "fsl_rgpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitADC();
    BOARD_InitPWM();
    BOARD_InitLPUART();
    BOARD_InitENC();
    BOARD_InitCMP();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: N15, peripheral: RGPIO4, signal: 'gpio_io, 13', pin_signal: GPIO_AD_13, direction: OUTPUT}
  - {pin_num: P17, peripheral: RGPIO4, signal: 'gpio_io, 12', pin_signal: GPIO_AD_12, direction: OUTPUT, pull_up_down_config: Pull_Down}
  - {pin_num: M16, peripheral: RGPIO4, signal: 'gpio_io, 27', pin_signal: GPIO_AD_27, direction: OUTPUT}
  - {pin_num: T14, peripheral: RGPIO4, signal: 'gpio_io, 08', pin_signal: GPIO_AD_08, direction: OUTPUT}
  - {pin_num: B4, peripheral: RGPIO1, signal: 'gpio_io, 04', pin_signal: GPIO_AON_04, direction: INPUT, gpio_interrupt_output: no_init, pull_up_down_config: Pull_Up}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of SW8 on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_04 (pin B4) */
  rgpio_pin_config_t SW8_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_04 (pin B4) */
  RGPIO_PinInit(RGPIO1, 4U, &SW8_config);
  /* Configures GPIO pin interrupt/DMA request on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_04 (pin B4) */
  RGPIO_SetPinInterruptConfig(RGPIO1, 4U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration of TP0 on GPIO_AD_08 (pin T14) */
  rgpio_pin_config_t TP0_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_AD_08 (pin T14) */
  RGPIO_PinInit(RGPIO4, 8U, &TP0_config);

  /* GPIO configuration of TP2 on GPIO_AD_12 (pin P17) */
  rgpio_pin_config_t TP2_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_AD_12 (pin P17) */
  RGPIO_PinInit(RGPIO4, 12U, &TP2_config);

  /* GPIO configuration of TP1 on GPIO_AD_13 (pin N15) */
  rgpio_pin_config_t TP1_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_AD_13 (pin N15) */
  RGPIO_PinInit(RGPIO4, 13U, &TP1_config);

  /* GPIO configuration of USER_LED1 on GPIO_AD_27 (pin M16) */
  rgpio_pin_config_t USER_LED1_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_AD_27 (pin M16) */
  RGPIO_PinInit(RGPIO4, 27U, &USER_LED1_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_08_GPIO4_IO08,           /* GPIO_AD_08 is configured as GPIO4_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_12_GPIO4_IO12,           /* GPIO_AD_12 is configured as GPIO4_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_13_GPIO4_IO13,           /* GPIO_AD_13 is configured as GPIO4_IO13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_27_GPIO4_IO27,           /* GPIO_AD_27 is configured as GPIO4_IO27 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_04_GPIO1_IO04,          /* GPIO_AON_04 is configured as GPIO1_IO04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_12_GPIO4_IO12,           /* GPIO_AD_12 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_04_GPIO1_IO04,          /* GPIO_AON_04 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled */
}


